results/wrk2/oraclejdk10/jsonpost.txt
andriy@notebook:~/Projects/com/github/plokhotnyuk/play$ ./wrk -c50 -d1m -t4 -R40000 -L -v -s src/test/lua/jsonPost.lua http://localhost:9000/json
wrk 4.0.0 [epoll] Copyright (C) 2012 Will Glozer
Running 1m test @ http://localhost:9000/json
  4 threads and 50 connections
  Thread calibration: mean lat.: 1.508ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.491ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.483ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.486ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.45ms    0.97ms  31.63ms   85.96%
    Req/Sec    10.55k     1.08k   24.22k    78.84%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.30ms
 75.000%    1.81ms
 90.000%    2.32ms
 99.000%    5.02ms
 99.900%   10.76ms
 99.990%   19.57ms
 99.999%   28.27ms
100.000%   31.65ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.112     0.000000            1         1.00
       0.583     0.100000       199850         1.11
       0.786     0.200000       399877         1.25
       0.964     0.300000       599514         1.43
       1.134     0.400000       800192         1.67
       1.303     0.500000       998965         2.00
       1.392     0.550000      1099658         2.22
       1.484     0.600000      1199164         2.50
       1.582     0.650000      1298553         2.86
       1.690     0.700000      1399120         3.33
       1.807     0.750000      1498291         4.00
       1.872     0.775000      1548832         4.44
       1.941     0.800000      1598261         5.00
       2.016     0.825000      1648139         5.71
       2.101     0.850000      1698791         6.67
       2.197     0.875000      1748265         8.00
       2.253     0.887500      1773577         8.89
       2.315     0.900000      1798208        10.00
       2.387     0.912500      1823109        11.43
       2.473     0.925000      1848066        13.33
       2.581     0.937500      1872928        16.00
       2.649     0.943750      1885224        17.78
       2.733     0.950000      1897840        20.00
       2.835     0.956250      1910326        22.86
       2.969     0.962500      1922728        26.67
       3.169     0.968750      1935154        32.00
       3.315     0.971875      1941439        35.56
       3.495     0.975000      1947645        40.00
       3.723     0.978125      1953886        45.71
       3.995     0.981250      1960145        53.33
       4.307     0.984375      1966421        64.00
       4.479     0.985938      1969541        71.11
       4.667     0.987500      1972660        80.00
       4.875     0.989062      1975768        91.43
       5.127     0.990625      1978885       106.67
       5.419     0.992188      1981991       128.00
       5.599     0.992969      1983548       142.22
       5.811     0.993750      1985092       160.00
       6.087     0.994531      1986672       182.86
       6.431     0.995313      1988218       213.33
       6.899     0.996094      1989781       256.00
       7.175     0.996484      1990554       284.44
       7.507     0.996875      1991344       320.00
       7.867     0.997266      1992118       365.71
       8.295     0.997656      1992898       426.67
       8.799     0.998047      1993680       512.00
       9.103     0.998242      1994065       568.89
       9.439     0.998437      1994459       640.00
       9.807     0.998633      1994846       731.43
      10.263     0.998828      1995236       853.33
      10.831     0.999023      1995634      1024.00
      11.143     0.999121      1995822      1137.78
      11.559     0.999219      1996020      1280.00
      12.055     0.999316      1996214      1462.86
      12.639     0.999414      1996406      1706.67
      13.239     0.999512      1996601      2048.00
      13.583     0.999561      1996700      2275.56
      14.071     0.999609      1996797      2560.00
      14.471     0.999658      1996896      2925.71
      15.023     0.999707      1996993      3413.33
      15.687     0.999756      1997089      4096.00
      16.159     0.999780      1997138      4551.11
      16.559     0.999805      1997187      5120.00
      17.151     0.999829      1997235      5851.43
      17.919     0.999854      1997285      6826.67
      18.735     0.999878      1997333      8192.00
      19.215     0.999890      1997357      9102.22
      19.663     0.999902      1997381     10240.00
      20.511     0.999915      1997406     11702.86
      21.167     0.999927      1997430     13653.33
      22.207     0.999939      1997456     16384.00
      22.671     0.999945      1997467     18204.44
      23.135     0.999951      1997480     20480.00
      23.663     0.999957      1997491     23405.71
      24.591     0.999963      1997503     27306.67
      25.327     0.999969      1997516     32768.00
      25.711     0.999973      1997522     36408.89
      25.935     0.999976      1997528     40960.00
      26.623     0.999979      1997534     46811.43
      27.071     0.999982      1997540     54613.33
      27.551     0.999985      1997546     65536.00
      27.887     0.999986      1997549     72817.78
      28.111     0.999988      1997552     81920.00
      28.239     0.999989      1997555     93622.86
      28.463     0.999991      1997558    109226.67
      28.735     0.999992      1997561    131072.00
      29.007     0.999993      1997563    145635.56
      29.039     0.999994      1997564    163840.00
      29.391     0.999995      1997566    187245.71
      29.583     0.999995      1997567    218453.33
      29.887     0.999996      1997569    262144.00
      29.903     0.999997      1997570    291271.11
      29.903     0.999997      1997570    327680.00
      29.983     0.999997      1997571    374491.43
      30.415     0.999998      1997572    436906.67
      30.671     0.999998      1997573    524288.00
      30.671     0.999998      1997573    582542.22
      30.671     0.999998      1997573    655360.00
      30.927     0.999999      1997574    748982.86
      30.927     0.999999      1997574    873813.33
      31.471     0.999999      1997575   1048576.00
      31.471     0.999999      1997575   1165084.44
      31.471     0.999999      1997575   1310720.00
      31.471     0.999999      1997575   1497965.71
      31.471     0.999999      1997575   1747626.67
      31.647     1.000000      1997576   2097152.00
      31.647     1.000000      1997576          inf
#[Mean    =        1.452, StdDeviation   =        0.973]
#[Max     =       31.632, Total count    =      1997576]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2398838 requests in 1.00m, 0.88GB read
Requests/sec:  39981.16
Transfer/sec:     14.98MB