results/wrk2/oraclejdk10/plaintextget.txt
andriy@notebook:~/Projects/com/github/plokhotnyuk/play$ ./wrk -c50 -d1m -t4 -R90000 -L -v http://localhost:9000/plaintext
wrk 4.0.0 [epoll] Copyright (C) 2012 Will Glozer
Running 1m test @ http://localhost:9000/plaintext
  4 threads and 50 connections
  Thread calibration: mean lat.: 1.305ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.302ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.288ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.268ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.31ms    1.03ms  37.06ms   86.27%
    Req/Sec    23.76k     2.46k   43.44k    75.43%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.12ms
 75.000%    1.67ms
 90.000%    2.32ms
 99.000%    4.75ms
 99.900%   12.33ms
 99.990%   18.32ms
 99.999%   32.30ms
100.000%   37.09ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.042     0.000000            1         1.00
       0.408     0.100000       451456         1.11
       0.596     0.200000       901379         1.25
       0.772     0.300000      1349439         1.43
       0.944     0.400000      1799935         1.67
       1.119     0.500000      2248969         2.00
       1.210     0.550000      2472580         2.22
       1.308     0.600000      2698311         2.50
       1.415     0.650000      2921623         2.86
       1.536     0.700000      3146984         3.33
       1.673     0.750000      3371231         4.00
       1.751     0.775000      3484624         4.44
       1.836     0.800000      3596252         5.00
       1.931     0.825000      3709047         5.71
       2.039     0.850000      3821350         6.67
       2.165     0.875000      3934194         8.00
       2.237     0.887500      3989995         8.89
       2.317     0.900000      4045190        10.00
       2.411     0.912500      4102511        11.43
       2.517     0.925000      4157679        13.33
       2.647     0.937500      4214368        16.00
       2.723     0.943750      4242227        17.78
       2.809     0.950000      4270026        20.00
       2.913     0.956250      4298240        22.86
       3.037     0.962500      4326272        26.67
       3.199     0.968750      4354252        32.00
       3.303     0.971875      4368391        35.56
       3.429     0.975000      4382379        40.00
       3.585     0.978125      4396405        45.71
       3.783     0.981250      4410381        53.33
       4.043     0.984375      4424429        64.00
       4.203     0.985938      4431562        71.11
       4.387     0.987500      4438548        80.00
       4.599     0.989062      4445508        91.43
       4.859     0.990625      4452558       106.67
       5.175     0.992188      4459547       128.00
       5.371     0.992969      4463104       142.22
       5.599     0.993750      4466577       160.00
       5.891     0.994531      4470079       182.86
       6.275     0.995313      4473609       213.33
       6.815     0.996094      4477084       256.00
       7.203     0.996484      4478849       284.44
       7.727     0.996875      4480600       320.00
       8.407     0.997266      4482358       365.71
       9.143     0.997656      4484112       426.67
       9.975     0.998047      4485871       512.00
      10.439     0.998242      4486752       568.89
      10.887     0.998437      4487619       640.00
      11.399     0.998633      4488506       731.43
      11.895     0.998828      4489374       853.33
      12.399     0.999023      4490254      1024.00
      12.663     0.999121      4490695      1137.78
      12.927     0.999219      4491132      1280.00
      13.239     0.999316      4491568      1462.86
      13.623     0.999414      4492010      1706.67
      14.023     0.999512      4492445      2048.00
      14.263     0.999561      4492665      2275.56
      14.503     0.999609      4492894      2560.00
      14.775     0.999658      4493109      2925.71
      15.111     0.999707      4493328      3413.33
      15.463     0.999756      4493541      4096.00
      15.663     0.999780      4493656      4551.11
      15.903     0.999805      4493765      5120.00
      16.175     0.999829      4493871      5851.43
      16.575     0.999854      4493980      6826.67
      17.327     0.999878      4494091      8192.00
      17.887     0.999890      4494146      9102.22
      18.479     0.999902      4494201     10240.00
      19.327     0.999915      4494254     11702.86
      20.175     0.999927      4494310     13653.33
      21.231     0.999939      4494364     16384.00
      21.935     0.999945      4494392     18204.44
      22.607     0.999951      4494419     20480.00
      23.743     0.999957      4494446     23405.71
      24.639     0.999963      4494474     27306.67
      26.271     0.999969      4494501     32768.00
      27.055     0.999973      4494515     36408.89
      27.919     0.999976      4494529     40960.00
      28.959     0.999979      4494543     46811.43
      29.999     0.999982      4494556     54613.33
      30.767     0.999985      4494570     65536.00
      31.199     0.999986      4494577     72817.78
      31.695     0.999988      4494584     81920.00
      32.047     0.999989      4494590     93622.86
      32.719     0.999991      4494597    109226.67
      33.535     0.999992      4494604    131072.00
      33.727     0.999993      4494609    145635.56
      34.079     0.999994      4494611    163840.00
      34.367     0.999995      4494614    187245.71
      34.911     0.999995      4494619    218453.33
      35.103     0.999996      4494621    262144.00
      35.295     0.999997      4494623    291271.11
      35.359     0.999997      4494625    327680.00
      35.551     0.999997      4494626    374491.43
      35.679     0.999998      4494628    436906.67
      35.775     0.999998      4494630    524288.00
      35.871     0.999998      4494631    582542.22
      35.967     0.999998      4494632    655360.00
      35.967     0.999999      4494632    748982.86
      36.063     0.999999      4494633    873813.33
      36.319     0.999999      4494634   1048576.00
      36.479     0.999999      4494635   1165084.44
      36.479     0.999999      4494635   1310720.00
      36.479     0.999999      4494635   1497965.71
      36.543     0.999999      4494636   1747626.67
      36.543     1.000000      4494636   2097152.00
      36.863     1.000000      4494637   2330168.89
      36.863     1.000000      4494637   2621440.00
      36.863     1.000000      4494637   2995931.43
      36.863     1.000000      4494637   3495253.33
      36.863     1.000000      4494637   4194304.00
      37.087     1.000000      4494638   4660337.78
      37.087     1.000000      4494638          inf
#[Mean    =        1.310, StdDeviation   =        1.034]
#[Max     =       37.056, Total count    =      4494638]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5397422 requests in 1.00m, 1.95GB read
Requests/sec:  89957.70
Transfer/sec:     33.29MB